ir_version: 6
producer_name: "pytorch"
producer_version: "1.8"
model_version: 0
graph {
  name: "torch-jit-export"
  node {
    input: "input.1"
    input: "module.conv1.weight"
    output: "298"
    name: "Conv_0"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 7
      ints: 7
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 3
      ints: 3
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "298"
    input: "1560"
    output: "315"
    name: "Mul_1"
    op_type: "Mul"
  }
  node {
    input: "315"
    input: "1562"
    output: "316"
    name: "Add_2"
    op_type: "Add"
  }
  node {
    input: "316"
    output: "317"
    name: "Relu_3"
    op_type: "Relu"
  }
  node {
    input: "317"
    output: "318"
    name: "MaxPool_4"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 0
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "318"
    input: "1503"
    input: "1504"
    output: "1502"
    name: "Conv_5"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1502"
    output: "321"
    name: "Relu_6"
    op_type: "Relu"
  }
  node {
    input: "321"
    input: "1506"
    input: "1507"
    output: "1505"
    name: "Conv_7"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1505"
    input: "318"
    output: "324"
    name: "Add_8"
    op_type: "Add"
  }
  node {
    input: "324"
    output: "325"
    name: "Relu_9"
    op_type: "Relu"
  }
  node {
    input: "325"
    input: "1509"
    input: "1510"
    output: "1508"
    name: "Conv_10"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "1508"
    output: "328"
    name: "Relu_11"
    op_type: "Relu"
  }
  node {
    input: "328"
    input: "1512"
    input: "1513"
    output: "1511"
    name: "Conv_12"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "325"
    input: "1515"
    input: "1516"
    output: "1514"
    name: "Conv_13"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "1511"
    input: "1514"
    output: "333"
    name: "Add_14"
    op_type: "Add"
  }
  node {
    input: "333"
    output: "334"
    name: "Relu_15"
    op_type: "Relu"
  }
  node {
    input: "334"
    input: "1518"
    input: "1519"
    output: "1517"
    name: "Conv_16"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1517"
    output: "337"
    name: "Relu_17"
    op_type: "Relu"
  }
  node {
    input: "337"
    input: "1521"
    input: "1522"
    output: "1520"
    name: "Conv_18"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1520"
    input: "334"
    output: "340"
    name: "Add_19"
    op_type: "Add"
  }
  node {
    input: "340"
    output: "341"
    name: "Relu_20"
    op_type: "Relu"
  }
  node {
    input: "341"
    input: "1524"
    input: "1525"
    output: "1523"
    name: "Conv_21"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "1523"
    output: "344"
    name: "Relu_22"
    op_type: "Relu"
  }
  node {
    input: "344"
    input: "1527"
    input: "1528"
    output: "1526"
    name: "Conv_23"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "341"
    input: "1530"
    input: "1531"
    output: "1529"
    name: "Conv_24"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "1526"
    input: "1529"
    output: "349"
    name: "Add_25"
    op_type: "Add"
  }
  node {
    input: "349"
    output: "350"
    name: "Relu_26"
    op_type: "Relu"
  }
  node {
    input: "350"
    input: "1533"
    input: "1534"
    output: "1532"
    name: "Conv_27"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1532"
    output: "353"
    name: "Relu_28"
    op_type: "Relu"
  }
  node {
    input: "353"
    input: "1536"
    input: "1537"
    output: "1535"
    name: "Conv_29"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1535"
    input: "350"
    output: "356"
    name: "Add_30"
    op_type: "Add"
  }
  node {
    input: "356"
    output: "357"
    name: "Relu_31"
    op_type: "Relu"
  }
  node {
    input: "357"
    input: "1539"
    input: "1540"
    output: "1538"
    name: "Conv_32"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "1538"
    output: "360"
    name: "Relu_33"
    op_type: "Relu"
  }
  node {
    input: "360"
    input: "1542"
    input: "1543"
    output: "1541"
    name: "Conv_34"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "357"
    input: "1545"
    input: "1546"
    output: "1544"
    name: "Conv_35"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "1541"
    input: "1544"
    output: "365"
    name: "Add_36"
    op_type: "Add"
  }
  node {
    input: "365"
    output: "366"
    name: "Relu_37"
    op_type: "Relu"
  }
  node {
    input: "366"
    input: "1548"
    input: "1549"
    output: "1547"
    name: "Conv_38"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1547"
    output: "369"
    name: "Relu_39"
    op_type: "Relu"
  }
  node {
    input: "369"
    input: "1551"
    input: "1552"
    output: "1550"
    name: "Conv_40"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1550"
    input: "366"
    output: "372"
    name: "Add_41"
    op_type: "Add"
  }
  node {
    input: "372"
    output: "373"
    name: "Relu_42"
    op_type: "Relu"
  }
  node {
    output: "374"
    name: "Constant_43"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "x2"
    input: "374"
    output: "375"
    name: "Gather_44"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "375"
    output: "376"
    name: "Unsqueeze_45"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "373"
    output: "377"
    name: "Shape_46"
    op_type: "Shape"
  }
  node {
    output: "378"
    name: "Constant_47"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "377"
    input: "378"
    output: "379"
    name: "Gather_48"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "373"
    output: "380"
    name: "Shape_49"
    op_type: "Shape"
  }
  node {
    output: "381"
    name: "Constant_50"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\003\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "380"
    input: "381"
    output: "382"
    name: "Gather_51"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "379"
    output: "383"
    name: "Unsqueeze_52"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "382"
    output: "384"
    name: "Unsqueeze_53"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "383"
    input: "384"
    output: "385"
    name: "Concat_54"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "376"
    output: "386"
    name: "Shape_55"
    op_type: "Shape"
  }
  node {
    output: "387"
    name: "Constant_56"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "388"
    name: "Constant_57"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "389"
    name: "Constant_58"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "386"
    input: "388"
    input: "389"
    input: "387"
    output: "390"
    name: "Slice_59"
    op_type: "Slice"
  }
  node {
    input: "385"
    output: "391"
    name: "Cast_60"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "390"
    input: "391"
    output: "392"
    name: "Concat_61"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "393"
    name: "Constant_62"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
        raw_data: ""
      }
      type: TENSOR
    }
  }
  node {
    output: "394"
    name: "Constant_63"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
        raw_data: ""
      }
      type: TENSOR
    }
  }
  node {
    input: "376"
    input: "393"
    input: "394"
    input: "392"
    output: "395"
    name: "Resize_64"
    op_type: "Resize"
    attribute {
      name: "coordinate_transformation_mode"
      s: "asymmetric"
      type: STRING
    }
    attribute {
      name: "cubic_coeff_a"
      f: -0.75
      type: FLOAT
    }
    attribute {
      name: "mode"
      s: "nearest"
      type: STRING
    }
    attribute {
      name: "nearest_mode"
      s: "floor"
      type: STRING
    }
  }
  node {
    input: "395"
    output: "396"
    name: "Cast_65"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 9
      type: INT
    }
  }
  node {
    output: "397"
    name: "Constant_66"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "396"
    input: "397"
    output: "398"
    name: "Gather_67"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "398"
    output: "399"
    name: "Not_68"
    op_type: "Not"
  }
  node {
    output: "400"
    name: "Constant_69"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 6
        raw_data: "\001\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "399"
    output: "401"
    name: "Cast_70"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "401"
    input: "400"
    output: "402"
    name: "CumSum_71"
    op_type: "CumSum"
  }
  node {
    output: "403"
    name: "Constant_72"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 6
        raw_data: "\002\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "399"
    output: "404"
    name: "Cast_73"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "404"
    input: "403"
    output: "405"
    name: "CumSum_74"
    op_type: "CumSum"
  }
  node {
    output: "406"
    name: "Constant_75"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "407"
    name: "Constant_76"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    output: "408"
    name: "Constant_77"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\177"
      }
      type: TENSOR
    }
  }
  node {
    output: "409"
    name: "Constant_78"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "402"
    input: "407"
    input: "408"
    input: "406"
    input: "409"
    output: "410"
    name: "Slice_79"
    op_type: "Slice"
  }
  node {
    output: "411"
    name: "Constant_80"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\2757\2065"
      }
      type: TENSOR
    }
  }
  node {
    input: "410"
    input: "411"
    output: "412"
    name: "Add_81"
    op_type: "Add"
  }
  node {
    input: "402"
    input: "412"
    output: "413"
    name: "Div_82"
    op_type: "Div"
  }
  node {
    output: "414"
    name: "Constant_83"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\333\017\311@"
      }
      type: TENSOR
    }
  }
  node {
    input: "413"
    input: "414"
    output: "415"
    name: "Mul_84"
    op_type: "Mul"
  }
  node {
    output: "416"
    name: "Constant_85"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "417"
    name: "Constant_86"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    output: "418"
    name: "Constant_87"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\177"
      }
      type: TENSOR
    }
  }
  node {
    output: "419"
    name: "Constant_88"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "405"
    input: "417"
    input: "418"
    input: "416"
    input: "419"
    output: "420"
    name: "Slice_89"
    op_type: "Slice"
  }
  node {
    output: "421"
    name: "Constant_90"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\2757\2065"
      }
      type: TENSOR
    }
  }
  node {
    input: "420"
    input: "421"
    output: "422"
    name: "Add_91"
    op_type: "Add"
  }
  node {
    input: "405"
    input: "422"
    output: "423"
    name: "Div_92"
    op_type: "Div"
  }
  node {
    output: "424"
    name: "Constant_93"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\333\017\311@"
      }
      type: TENSOR
    }
  }
  node {
    input: "423"
    input: "424"
    output: "425"
    name: "Mul_94"
    op_type: "Mul"
  }
  node {
    input: "425"
    output: "426"
    name: "Unsqueeze_95"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 3
      type: INTS
    }
  }
  node {
    output: "427"
    name: "Constant_96"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        raw_data: "\000\000\200?\000\000\200?\302bJ@\302bJ@\000\000 A\000\000 Ar\373\374Ar\373\374A\000\000\310B\000\000\310B\'\035\236C\'\035\236C\000\000zD\000\000zDq\244EEq\244EE"
      }
      type: TENSOR
    }
  }
  node {
    input: "426"
    input: "427"
    output: "428"
    name: "Div_97"
    op_type: "Div"
  }
  node {
    input: "415"
    output: "429"
    name: "Unsqueeze_98"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 3
      type: INTS
    }
  }
  node {
    output: "430"
    name: "Constant_99"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 16
        data_type: 1
        raw_data: "\000\000\200?\000\000\200?\302bJ@\302bJ@\000\000 A\000\000 Ar\373\374Ar\373\374A\000\000\310B\000\000\310B\'\035\236C\'\035\236C\000\000zD\000\000zDq\244EEq\244EE"
      }
      type: TENSOR
    }
  }
  node {
    input: "429"
    input: "430"
    output: "431"
    name: "Div_100"
    op_type: "Div"
  }
  node {
    output: "432"
    name: "Constant_101"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\003\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "433"
    name: "Constant_102"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "434"
    name: "Constant_103"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\177"
      }
      type: TENSOR
    }
  }
  node {
    output: "435"
    name: "Constant_104"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "428"
    input: "433"
    input: "434"
    input: "432"
    input: "435"
    output: "436"
    name: "Slice_105"
    op_type: "Slice"
  }
  node {
    input: "436"
    output: "437"
    name: "Sin_106"
    op_type: "Sin"
  }
  node {
    output: "438"
    name: "Constant_107"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\003\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "439"
    name: "Constant_108"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "440"
    name: "Constant_109"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\177"
      }
      type: TENSOR
    }
  }
  node {
    output: "441"
    name: "Constant_110"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "428"
    input: "439"
    input: "440"
    input: "438"
    input: "441"
    output: "442"
    name: "Slice_111"
    op_type: "Slice"
  }
  node {
    input: "442"
    output: "443"
    name: "Cos_112"
    op_type: "Cos"
  }
  node {
    input: "437"
    output: "444"
    name: "Unsqueeze_113"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 4
      type: INTS
    }
  }
  node {
    input: "443"
    output: "445"
    name: "Unsqueeze_114"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 4
      type: INTS
    }
  }
  node {
    input: "444"
    input: "445"
    output: "446"
    name: "Concat_115"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 4
      type: INT
    }
  }
  node {
    input: "446"
    output: "447"
    name: "Shape_116"
    op_type: "Shape"
  }
  node {
    output: "448"
    name: "Constant_117"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "449"
    name: "Constant_118"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "450"
    name: "Constant_119"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\003\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "447"
    input: "449"
    input: "450"
    input: "448"
    output: "451"
    name: "Slice_120"
    op_type: "Slice"
  }
  node {
    output: "452"
    name: "Constant_121"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    input: "451"
    input: "452"
    output: "453"
    name: "Concat_122"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "446"
    input: "453"
    output: "454"
    name: "Reshape_123"
    op_type: "Reshape"
  }
  node {
    output: "455"
    name: "Constant_124"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\003\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "456"
    name: "Constant_125"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "457"
    name: "Constant_126"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\177"
      }
      type: TENSOR
    }
  }
  node {
    output: "458"
    name: "Constant_127"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "431"
    input: "456"
    input: "457"
    input: "455"
    input: "458"
    output: "459"
    name: "Slice_128"
    op_type: "Slice"
  }
  node {
    input: "459"
    output: "460"
    name: "Sin_129"
    op_type: "Sin"
  }
  node {
    output: "461"
    name: "Constant_130"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\003\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "462"
    name: "Constant_131"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "463"
    name: "Constant_132"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\177"
      }
      type: TENSOR
    }
  }
  node {
    output: "464"
    name: "Constant_133"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "431"
    input: "462"
    input: "463"
    input: "461"
    input: "464"
    output: "465"
    name: "Slice_134"
    op_type: "Slice"
  }
  node {
    input: "465"
    output: "466"
    name: "Cos_135"
    op_type: "Cos"
  }
  node {
    input: "460"
    output: "467"
    name: "Unsqueeze_136"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 4
      type: INTS
    }
  }
  node {
    input: "466"
    output: "468"
    name: "Unsqueeze_137"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 4
      type: INTS
    }
  }
  node {
    input: "467"
    input: "468"
    output: "469"
    name: "Concat_138"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 4
      type: INT
    }
  }
  node {
    input: "469"
    output: "470"
    name: "Shape_139"
    op_type: "Shape"
  }
  node {
    output: "471"
    name: "Constant_140"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "472"
    name: "Constant_141"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "473"
    name: "Constant_142"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\003\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "470"
    input: "472"
    input: "473"
    input: "471"
    output: "474"
    name: "Slice_143"
    op_type: "Slice"
  }
  node {
    output: "475"
    name: "Constant_144"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    input: "474"
    input: "475"
    output: "476"
    name: "Concat_145"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "469"
    input: "476"
    output: "477"
    name: "Reshape_146"
    op_type: "Reshape"
  }
  node {
    input: "477"
    input: "454"
    output: "478"
    name: "Concat_147"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 3
      type: INT
    }
  }
  node {
    input: "478"
    output: "479"
    name: "Transpose_148"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 3
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "373"
    input: "module.input_proj.weight"
    input: "module.input_proj.bias"
    output: "480"
    name: "Conv_149"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "480"
    output: "481"
    name: "Shape_150"
    op_type: "Shape"
  }
  node {
    output: "482"
    name: "Constant_151"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "481"
    input: "482"
    output: "483"
    name: "Gather_152"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "480"
    output: "484"
    name: "Shape_153"
    op_type: "Shape"
  }
  node {
    output: "485"
    name: "Constant_154"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "486"
    name: "Constant_155"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "487"
    name: "Constant_156"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "484"
    input: "486"
    input: "487"
    input: "485"
    output: "488"
    name: "Slice_157"
    op_type: "Slice"
  }
  node {
    output: "489"
    name: "Constant_158"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    input: "488"
    input: "489"
    output: "490"
    name: "Concat_159"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "480"
    input: "490"
    output: "491"
    name: "Reshape_160"
    op_type: "Reshape"
  }
  node {
    input: "491"
    output: "492"
    name: "Transpose_161"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 2
      ints: 0
      ints: 1
      type: INTS
    }
  }
  node {
    input: "479"
    output: "493"
    name: "Shape_162"
    op_type: "Shape"
  }
  node {
    output: "494"
    name: "Constant_163"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "495"
    name: "Constant_164"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "496"
    name: "Constant_165"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "493"
    input: "495"
    input: "496"
    input: "494"
    output: "497"
    name: "Slice_166"
    op_type: "Slice"
  }
  node {
    output: "498"
    name: "Constant_167"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    input: "497"
    input: "498"
    output: "499"
    name: "Concat_168"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "479"
    input: "499"
    output: "500"
    name: "Reshape_169"
    op_type: "Reshape"
  }
  node {
    input: "500"
    output: "501"
    name: "Transpose_170"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 2
      ints: 0
      ints: 1
      type: INTS
    }
  }
  node {
    input: "483"
    output: "506"
    name: "Unsqueeze_171"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "1564"
    input: "506"
    input: "1565"
    output: "508"
    name: "Concat_172"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "483"
    output: "510"
    name: "Unsqueeze_173"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "1566"
    input: "510"
    input: "1567"
    output: "512"
    name: "Concat_174"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "508"
    output: "513"
    name: "Shape_175"
    op_type: "Shape"
  }
  node {
    input: "513"
    output: "514"
    name: "ConstantOfShape_176"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "1563"
    input: "514"
    output: "515"
    name: "Expand_177"
    op_type: "Expand"
  }
  node {
    input: "515"
    input: "512"
    output: "516"
    name: "Tile_178"
    op_type: "Tile"
  }
  node {
    input: "398"
    output: "517"
    name: "Flatten_179"
    op_type: "Flatten"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "516"
    output: "518"
    name: "Shape_180"
    op_type: "Shape"
  }
  node {
    input: "518"
    output: "519"
    name: "ConstantOfShape_181"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        raw_data: "\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "492"
    input: "501"
    output: "520"
    name: "Add_182"
    op_type: "Add"
  }
  node {
    input: "520"
    output: "521"
    name: "Shape_183"
    op_type: "Shape"
  }
  node {
    output: "522"
    name: "Constant_184"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "521"
    input: "522"
    output: "523"
    name: "Gather_185"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "520"
    output: "524"
    name: "Shape_186"
    op_type: "Shape"
  }
  node {
    output: "525"
    name: "Constant_187"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "524"
    input: "525"
    output: "526"
    name: "Gather_188"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "520"
    output: "527"
    name: "Shape_189"
    op_type: "Shape"
  }
  node {
    output: "528"
    name: "Constant_190"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "527"
    input: "528"
    output: "529"
    name: "Gather_191"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "530"
    name: "Constant_192"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "529"
    input: "530"
    output: "531"
    name: "Div_193"
    op_type: "Div"
  }
  node {
    input: "531"
    output: "532"
    name: "Cast_194"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "532"
    output: "533"
    name: "Cast_195"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "529"
    output: "537"
    name: "Unsqueeze_196"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    output: "539"
    name: "Constant_197"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "module.transformer.encoder.layers.0.self_attn.in_proj_weight"
    input: "1568"
    input: "537"
    input: "1569"
    input: "539"
    output: "540"
    name: "Slice_198"
    op_type: "Slice"
  }
  node {
    input: "529"
    output: "544"
    name: "Unsqueeze_199"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    output: "546"
    name: "Constant_200"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "module.transformer.encoder.layers.0.self_attn.in_proj_bias"
    input: "1570"
    input: "544"
    input: "1571"
    input: "546"
    output: "547"
    name: "Slice_201"
    op_type: "Slice"
  }
  node {
    input: "540"
    output: "548"
    name: "Transpose_202"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
  }
  node {
    input: "520"
    input: "548"
    output: "549"
    name: "MatMul_203"
    op_type: "MatMul"
  }
  node {
    input: "549"
    input: "547"
    output: "550"
    name: "Add_204"
    op_type: "Add"
  }
  node {
    output: "551"
    name: "Constant_205"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "529"
    input: "551"
    output: "552"
    name: "Mul_206"
    op_type: "Mul"
  }
  node {
    input: "529"
    output: "554"
    name: "Unsqueeze_207"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "552"
    output: "555"
    name: "Unsqueeze_208"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    output: "557"
    name: "Constant_209"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "module.transformer.encoder.layers.0.self_attn.in_proj_weight"
    input: "554"
    input: "555"
    input: "1572"
    input: "557"
    output: "558"
    name: "Slice_210"
    op_type: "Slice"
  }
  node {
    input: "529"
    output: "560"
    name: "Unsqueeze_211"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "552"
    output: "561"
    name: "Unsqueeze_212"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    output: "563"
    name: "Constant_213"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "module.transformer.encoder.layers.0.self_attn.in_proj_bias"
    input: "560"
    input: "561"
    input: "1573"
    input: "563"
    output: "564"
    name: "Slice_214"
    op_type: "Slice"
  }
  node {
    input: "558"
    output: "565"
    name: "Transpose_215"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
  }
  node {
    input: "520"
    input: "565"
    output: "566"
    name: "MatMul_216"
    op_type: "MatMul"
  }
  node {
    input: "566"
    input: "564"
    output: "567"
    name: "Add_217"
    op_type: "Add"
  }
  node {
    output: "568"
    name: "Constant_218"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "529"
    input: "568"
    output: "569"
    name: "Mul_219"
    op_type: "Mul"
  }
  node {
    input: "569"
    output: "572"
    name: "Unsqueeze_220"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    output: "575"
    name: "Constant_221"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "module.transformer.encoder.layers.0.self_attn.in_proj_weight"
    input: "572"
    input: "1574"
    input: "1575"
    input: "575"
    output: "576"
    name: "Slice_222"
    op_type: "Slice"
  }
  node {
    input: "569"
    output: "579"
    name: "Unsqueeze_223"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    output: "582"
    name: "Constant_224"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "module.transformer.encoder.layers.0.self_attn.in_proj_bias"
    input: "579"
    input: "1576"
    input: "1577"
    input: "582"
    output: "583"
    name: "Slice_225"
    op_type: "Slice"
  }
  node {
    input: "576"
    output: "584"
    name: "Transpose_226"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
  }
  node {
    input: "492"
    input: "584"
    output: "585"
    name: "MatMul_227"
    op_type: "MatMul"
  }
  node {
    input: "585"
    input: "583"
    output: "586"
    name: "Add_228"
    op_type: "Add"
  }
  node {
    output: "587"
    name: "Constant_229"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\200>"
      }
      type: TENSOR
    }
  }
  node {
    input: "550"
    input: "587"
    output: "588"
    name: "Mul_230"
    op_type: "Mul"
  }
  node {
    output: "589"
    name: "Constant_231"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "526"
    input: "589"
    output: "590"
    name: "Mul_232"
    op_type: "Mul"
  }
  node {
    input: "523"
    output: "591"
    name: "Unsqueeze_233"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "590"
    output: "592"
    name: "Unsqueeze_234"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "533"
    output: "593"
    name: "Unsqueeze_235"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "591"
    input: "592"
    input: "593"
    output: "594"
    name: "Concat_236"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "588"
    input: "594"
    output: "595"
    name: "Reshape_237"
    op_type: "Reshape"
  }
  node {
    input: "595"
    output: "596"
    name: "Transpose_238"
